web/app/controllers/admin_controller.rb

  def video_view
    @video = Video.find_by_id(params[:id])
---
SELECT  "videos".* FROM "videos"  WHERE "videos"."id" = 1 LIMIT 1

  def video_add
    @video = Video.new(video_params)
    if @video.save
---
INSERT INTO "videos" ("after_content", "before_content", "excerpt", "image", "title", "topic", "url") VALUES (?, ?, ?, ?, ?, ?, ?)  [["after_content", ""], ["before_content", ""], ["excerpt", ""], ["image", ""], ["title", "郭德纲"], ["topic", 0], ["url", "https://www.youtube.com/watch?v=zE1QNTtU8i0"]]

  def video_edit
    @topics = get_topics()
    @video = Video.find_by_id(params[:id])
---
SELECT  "videos".* FROM "videos"  WHERE "videos"."id" = 1 LIMIT 1

  def video_update
    @video = Video.find_by_id(params[:id])
    if  @video.update_attributes(video_params)
---
SELECT  "videos".* FROM "videos"  WHERE "videos"."id" = 1 LIMIT 1
UPDATE "videos" SET "url" = ? WHERE "videos"."id" = 2  [["url", "www.youtube.com/watch?v=p1ctq_Nu6Qw"]]