simple_video_gallery/app/controllers/videos_controller.rb

SELECT "videos".* FROM "videos"  WHERE (topic = 15)
---
  def videos
    @topid = 15
    @list = Video.where("topic = ?",@topid)